Update game menu and readme
